{
  "backend/main.mo": "Motoko canister storing wound entries per caller with photo blobs, questionnaire text, and generated reports; supports adding entries and retrieving sorted history.",
  "feature_evidence.json": "Feature-to-file mapping documenting implemented frontend features, related components, and test coverage metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries describing responsibilities of key frontend components, pages, hooks, and utilities.",
  "frontend/index.css": "Tailwind base styles plus a custom OKLCH color system for light and dark themes.",
  "frontend/index.html": "Basic HTML shell mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes for new entries, history, details, and reports, wrapped with layout and toaster.",
  "frontend/src/components/branding/BrandMark.tsx": "Displays the app logo image.",
  "frontend/src/components/layout/AppLayout.tsx": "Shared layout with header navigation, outlet rendering, and a footer attribution.",
  "frontend/src/components/wound/Disclaimers.tsx": "Provides reusable medical disclaimer and privacy notice alert components.",
  "frontend/src/components/wound/PhotoInput.tsx": "Photo capture/upload component handling camera use, validation, preview, and retake/clear actions.",
  "frontend/src/components/wound/photoUtils.ts": "Provides image file validation and a utility to convert files into Uint8Array buffers.",
  "frontend/src/components/wound/QuestionnaireForm.tsx": "React form component that collects wound details and infection signs, updating parent callbacks when data or disclaimer status changes.",
  "frontend/src/components/wound/report/generateReport.ts": "Generates a wound report JSON string with summary text, risk flags, guidance, and escalation advice based on questionnaire data.",
  "frontend/src/components/wound/woundModels.ts": "Defines the QuestionnaireData interface and helper functions to serialize and deserialize questionnaire JSON.",
  "frontend/src/hooks/useActor.ts": "Initializes and manages an authenticated or anonymous backend actor, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication context and provider with login, logout, and stored identity handling.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching wound history and adding new wound entries via the backend actor.",
  "frontend/src/index.css": "TailwindCSS base and theme variables defining light and dark mode color tokens and global styles.",
  "frontend/src/main.tsx": "Application entry point that mounts React, wrapping the app with query and identity providers.",
  "frontend/src/pages/HistoryDetailPage.tsx": "Displays details of a selected wound entry, including photo, questionnaire data, and generated report with risk indicators.",
  "frontend/src/pages/HistoryPage.tsx": "Displays wound history with loading, error, empty, and list states, and allows navigating to individual entries or creating new ones.",
  "frontend/src/pages/NewWoundEntryPage.tsx": "Handles creating a new wound entry including photo upload, questionnaire input, disclaimer acceptance, submitting to backend, and storing data for report display.",
  "frontend/src/pages/ReportPage.tsx": "Shows the generated wound report using stored submission data, including photo preview, risk flags, and medical disclaimers.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, typography, animations, and scanning paths for styling.",
  "project_state.json": "Describes project metadata, feature implementations, and requirement tracking for the wound assessment app."
}